[
  {
    "Title": "User Story 1: Benutzeranmeldung mit Username und Passwort",
    "Description": "Als User möchte ich mich mit meinem Username und Passwort anmelden, um personalisierte Daten in der App nutzen zu können.",
    "AcceptanceCriteria": "- Man kann einen Usernamen eingeben\n- Man kann ein Passwort eingeben\n- User wird mit Username und Passwort authentifiziert\n\nNicht-Ziele:\n- Anmeldung über 2-Faktorauthentifizierung\n- Anmeldung mit Email oder Telefonnummer",
    "StoryPoints": 5,
    "Priority": 1,
    "Tags": "Authentication; MVP; Security",
    "State": "To Do"
  },
  {
    "Title": "User Story 2: Fragebogen ausfüllen zur Reiseeingrenzung",
    "Description": "Als angemeldeter User möchte ich einen Fragebogen ausfüllen können, um meine Reisevorschläge eingrenzen zu können.",
    "AcceptanceCriteria": "Granulare User Stories:\n- Als angemeldeter User möchte ich mir aussuchen, ob das Klima warm, kalt oder egal ist, womit mir passende Reiseangebote angezeigt werden\n- Als angemeldeter User möchte ich mir aussuchen, ob die Reise ein Abenteuer-, Entspannungs-, Luxus- oder Kultururlaub sein wird\n- Als angemeldeter User möchte ich mir aussuchen, ob ich zum Reiseziel mit dem Zug, Flugzeug oder Auto reisen muss\n- Als angemeldeter User möchte ich den Zeitraum der Reise eingrenzen\n- Als angemeldeter User möchte ich die Größe der Reisegruppe auf alleine, zu zweit, 3-5 Personen oder mehr als 5 Personen filtern\n- Als Admin möchte ich, dass ein angemeldeter User immer genau eine Antwort auswählen kann",
    "StoryPoints": 8,
    "Priority": 1,
    "Tags": "Questionnaire; MVP; UX",
    "State": "To Do"
  },
  {
    "Title": "User Story 3: Reisevorschläge anhand Antworten anzeigen",
    "Description": "Als angemeldeter User möchte ich Vorschläge anhand meiner eingegebenen Antworten bekommen, um meine Auswahl an Urlaubsmöglichkeiten eingrenzen zu können. Als angemeldeter User möchte ich meine Vorschläge in einer Liste mit den Informationen des Hotels, des Ortes und den Kosten der Gesamtreise präsentiert bekommen, damit ich einen oberflächlichen Vergleich der unterschiedlichen Reiseoptionen habe.",
    "AcceptanceCriteria": "- Anzeige der Ergebnisse in einer Liste\n  - sortieren\n  - filtern\n- Folgende Felder werden angezeigt:\n  - Name des Hotels\n  - Name des Ortes (Land, Ortsname/Adresse)\n  - Kosten der Reise (einheitlich in Euro umgerechnet)",
    "StoryPoints": 8,
    "Priority": 1,
    "Tags": "Search; Results; MVP",
    "State": "To Do"
  },
  {
    "Title": "User Story 4: Detailansicht der Urlaubsvorschläge",
    "Description": "Als angemeldeter User möchte ich eine Bildvorschau, einen Beschreibungstext der Reise, eine Liste von Nutzerbewertungen und eine durchschnittliche Gesamtwertung der Reise in Form einer Skala von 1-5 Sternen sehen, damit ich mir ein genaueres Bild über das Reiseziel machen kann.",
    "AcceptanceCriteria": "- Bildvorschau wird angezeigt\n- Beschreibungstext enthält:\n  - Adresse\n  - Land\n  - Klima\n  - Lokale Sehenswürdigkeiten\n- Erfahrungsberichte anderer User werden angezeigt\n- Durchschnittliche Gesamtwertung (1-5 Sterne) wird angezeigt",
    "StoryPoints": 5,
    "Priority": 2,
    "Tags": "Details; Reviews; UX",
    "State": "To Do"
  },
  {
    "Title": "User Story 5: Reise-Historie als Liste anzeigen",
    "Description": "Als angemeldeter Nutzer möchte ich eine Liste meiner bereits angesehenen Reisen einsehen können, um die Reisen leichter vergleichen zu können.",
    "AcceptanceCriteria": "- Eine Übersicht der bereits eingesehenen Reisen wird angezeigt\n- Die Reisen sind chronologisch sortiert\n\nZusätzliche User Stories (optional):\n- Weltkarte: Als angemeldeter Nutzer möchte ich eine Weltkarte meiner Reise-Historie sehen, damit ich einen visuellen Überblick über meine Reisen habe\n- Timeline: Als angemeldeter Nutzer möchte ich eine Timeline haben, in der meine bereits eingesehenen Reisen chronologisch aufgelistet werden",
    "StoryPoints": 5,
    "Priority": 3,
    "Tags": "History; UX; Tracking",
    "State": "To Do"
  }
]
